In [61]:
# install the packages needed to do EDA
%pip install pandas==2.2.1 numpy==1.26.4 pandasql==0.7.3

Requirement already satisfied: pandas==2.2.1 in c:\users\dell\.conda\envs\py312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy==1.26.4 in c:\users\dell\.conda\envs\py312\lib\site-packages (1.26.4)
Requirement already satisfied: pandasql==0.7.3 in c:\users\dell\.conda\envs\py312\lib\site-packages (0.7.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\.conda\envs\py312\lib\site-packages (from pandas==2.2.1) (2.9.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\.conda\envs\py312\lib\site-packages (from pandas==2.2.1) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\.conda\envs\py312\lib\site-packages (from pandas==2.2.1) (2024.1)
Requirement already satisfied: sqlalchemy in c:\users\dell\.conda\envs\py312\lib\site-packages (from pandasql==0.7.3) (2.0.29)
Requirement already satisfied: six>=1.5 in c:\users\dell\.conda\envs\py312\lib\site-packages (from python-dateutil>=2.8.2->pandas==2.2.1) (1.16.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\dell\.conda\envs\py312\lib\site-packages (from sqlalchemy->pandasql==0.7.3) (4.10.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dell\.conda\envs\py312\lib\site-packages (from sqlalchemy->pandasql==0.7.3) (3.0.3)
Note: you may need to restart the kernel to use updated packages.

#### loading the data into pandas dataframes

In [62]:
# import the the data from the csv files
import pandas as pd
import numpy as np

# read the data from the csv files
humidity_df = pd.read_csv('Data/Preprocessed Data/humidity_data.csv')
rainfall_df = pd.read_csv('Data/Preprocessed Data/rainfall_data.csv')
temperature_df = pd.read_csv('Data/Preprocessed Data/temperature_data.csv')
wind_speed_df = pd.read_csv('Data/Preprocessed Data/wind_data.csv')
patient_df = pd.read_csv('Data/Preprocessed Data/patient_data.csv')

## Patient Data Transformation

In [63]:
patient_df.head(10)

,year,week,Colombo_cases,Gampaha_cases,Kalutara_cases,Kandy_cases,Matale_cases,Nuwara_Eliya_cases,Galle_cases,Hambantota_cases,...,Trincomalee_cases,Kurunegala_cases,Puttalam_cases,Anuradhapura_cases,Polonnaruwa_cases,Badulla_cases,Monaragala_cases,Ratnapura_cases,Kegalle_cases,Kalmunai_cases
0,2007,1,71,12,12,20,4,1.0,1,1,...,0,16,6,4.0,1,2,0.0,1,1,0
1,2008,1,40,30,16,6,3,0.0,1,4,...,1,18,31,18.0,1,5,3.0,4,0,0
2,2009,1,15,7,1,11,4,0.0,0,6,...,0,2,1,2.0,0,1,1.0,2,16,0
3,2012,1,207,43,21,58,9,0.0,24,7,...,3,35,21,5.0,4,5,6.0,27,23,15
4,2013,1,95,82,10,15,5,4.0,6,7,...,2,52,15,22.0,1,12,6.0,8,28,6
5,2014,1,329,44,19,22,10,2.0,27,5,...,5,17,15,14.0,7,9,3.0,10,18,0
6,2015,1,311,160,31,94,23,7.0,30,12,...,17,43,41,22.0,6,54,2.0,20,19,63
7,2016,1,142,8,20,32,1,8.0,16,6,...,11,9,3,1.0,2,6,2.0,9,10,11
8,2017,1,511,137,88,66,25,12.0,176,31,...,22,80,18,16.0,11,40,21.0,63,34,90
9,2018,1,290,184,101,127,36,5.0,54,35,...,25,87,200,26.0,9,23,47.0,49,47,153

#### Date value related transformations for the dataframes

##### Convert Weekly patients data into monthly data

In [64]:
# convert humidity data month from numbers to names as Jan, Feb, Mar, etc
import calendar

humidity_df['Month'] = humidity_df['Month'].apply(lambda x: calendar.month_abbr[x])

In [65]:
# check unique values in the patient data
months = humidity_df.Month.unique()
print(np.sort(months))

['Apr' 'Aug' 'Dec' 'Feb' 'Jan' 'Jul' 'Jun' 'Mar' 'May' 'Nov' 'Oct' 'Sep']

In [66]:
# add new column to the patient data to indicate the exact data using year and week number
patient_df['Date'] = pd.to_datetime(patient_df['year'].astype(str) + ' ' + patient_df['week'].astype(str) + ' 1', format='%Y %W %w')

In [67]:
patient_df.sort_values(by="Date").Date.head(10)

0     2007-01-01
15    2007-01-08
33    2007-01-15
51    2007-01-22
69    2007-01-29
87    2007-02-05
104   2007-02-12
121   2007-02-19
138   2007-02-26
155   2007-03-05
Name: Date, dtype: datetime64[ns]

In [68]:
# drop the week column from the patient data
patient_df.drop('week', axis=1, inplace=True)

In [69]:
# check unique values in the patient data
years = patient_df.year.unique()
print(np.sort(years))
# 2013, 2015, 2021

[2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020
 2021 2022 2023 2024]

In [70]:
# aggregate the patient data to get the total number of patients per month using date column
patient_df = patient_df.resample('ME', on='Date').sum()

In [71]:
patient_df.drop('year', axis=1, inplace=True)

In [72]:
print(patient_df.head(20))

            Colombo_cases  Gampaha_cases  Kalutara_cases  Kandy_cases  \
Date
2007-01-31            244             64              60          120
2007-02-28            175             44              30           36
2007-03-31             61             26              22           21
2007-04-30             35             16              12           16
2007-05-31             44             17              13            7
2007-06-30            102             35              22           20
2007-07-31            163             37              39           29
2007-08-31            128             50              33           21
2007-09-30            158             78              46           18
2007-10-31            178             85              23           29
2007-11-30            195            136              55           29
2007-12-31            239            129              40           25
2008-01-31            156            122              46           19
2008-02-29            147             76              63           17
2008-03-31            137             69              50           29
2008-04-30            135             75              36           15
2008-05-31            163             69              46           15
2008-06-30            126             69              51           22
2008-07-31             96             46              24           19
2008-08-31            145             62              29           30

            Matale_cases  Nuwara_Eliya_cases  Galle_cases  Hambantota_cases  \
Date
2007-01-31            24                12.0           22                 6
2007-02-28            10                 1.0           12                 6
2007-03-31             4                 1.0            4                 5
2007-04-30             1                 0.0            1                 6
2007-05-31             2                 7.0            2                 2
2007-06-30             3                 1.0            4                 3
2007-07-31             5                 4.0            6                 5
2007-08-31             8                 1.0            7                 8
2007-09-30             4                 4.0            9                14
2007-10-31             6                 1.0            7                10
2007-11-30             7                 1.0            6                16
2007-12-31            16                 4.0            9                 8
2008-01-31             9                 0.0           16                 9
2008-02-29             6                 3.0            7                22
2008-03-31            11                 1.0           12                10
2008-04-30            11                 1.0            4                 6
2008-05-31             8                 5.0           11                 3
2008-06-30             7                 3.0            8                 4
2008-07-31             9                 1.0            5                 7
2008-08-31             8                 5.0           14                 8

            Matara_cases  Jaffna_cases  ...  Trincomalee_cases  \
Date                                    ...
2007-01-31            35             0  ...                  7
2007-02-28            12             0  ...                  3
2007-03-31             8             0  ...                  5
2007-04-30             9             0  ...                  4
2007-05-31             8             0  ...                  1
2007-06-30             9             0  ...                  4
2007-07-31            17             0  ...                  7
2007-08-31            10             0  ...                  2
2007-09-30            21             4  ...                  0
2007-10-31            31            58  ...                  0
2007-11-30            38            31  ...                  4
2007-12-31            30            19  ...                  2
2008-01-31            26             7  ...                  5
2008-02-29            22             1  ...                 49
2008-03-31            26             2  ...                 50
2008-04-30            17             4  ...                 24
2008-05-31            20             3  ...                  9
2008-06-30            25             3  ...                  9
2008-07-31            28             0  ...                  1
2008-08-31            35             0  ...                  3

            Kurunegala_cases  Puttalam_cases  Anuradhapura_cases  \
Date
2007-01-31                60              47                 6.0
2007-02-28                20              11                 5.0
2007-03-31                25               5                 4.0
2007-04-30                22               3                 4.0
2007-05-31                12               5                 8.0
2007-06-30                41               6                28.0
2007-07-31               114               6                48.0
2007-08-31                52              10                 5.0
2007-09-30                76              11                22.0
2007-10-31                84              28                22.0
2007-11-30                78              64                17.0
2007-12-31                78             119                40.0
2008-01-31                61              61                43.0
2008-02-29                27              30                17.0
2008-03-31                33              75                26.0
2008-04-30                33              36                 9.0
2008-05-31                14              29                12.0
2008-06-30                25              22                 0.0
2008-07-31                 9              10                 1.0
2008-08-31                22               6                 0.0

            Polonnaruwa_cases  Badulla_cases  Monaragala_cases  \
Date
2007-01-31                  9              7               5.0
2007-02-28                  4              3               0.0
2007-03-31                  3              4               1.0
2007-04-30                 10              1               0.0
2007-05-31                  0              3               3.0
2007-06-30                  6              2               1.0
2007-07-31                  2              8               6.0
2007-08-31                  5              6               9.0
2007-09-30                  4             12               8.0
2007-10-31                  4             12               4.0
2007-11-30                  5              6               5.0
2007-12-31                  5             12               7.0
2008-01-31                 11             11               4.0
2008-02-29                  7              5               5.0
2008-03-31                  8              3               6.0
2008-04-30                  7              7               3.0
2008-05-31                  8             12              10.0
2008-06-30                  8              4               4.0
2008-07-31                  5             10               2.0
2008-08-31                  1              8               4.0

            Ratnapura_cases  Kegalle_cases  Kalmunai_cases
Date
2007-01-31               13             33               0
2007-02-28               11              9               0
2007-03-31               14             13               0
2007-04-30                6              5               0
2007-05-31               12             12               0
2007-06-30               16             33               1
2007-07-31               47             19               0
2007-08-31               42             18               0
2007-09-30               38             29               0
2007-10-31               45             78               0
2007-11-30               26             36               1
2007-12-31               31             37               1
2008-01-31               15             24               0
2008-02-29               25             17               2
2008-03-31               13             39               2
2008-04-30                6             38              10
2008-05-31               12             40               3
2008-06-30               14             61               8
2008-07-31               55             34               0
2008-08-31               17             33               3

[20 rows x 26 columns]

In [73]:
# break down the date column into year, month
patient_df['Year'] = patient_df.index.year
patient_df['Month'] = patient_df.index.month
patient_df['Month'] = patient_df['Month'].apply(lambda x: calendar.month_abbr[x])

In [74]:
print(patient_df['Year'].head(20))

Date
2007-01-31    2007
2007-02-28    2007
2007-03-31    2007
2007-04-30    2007
2007-05-31    2007
2007-06-30    2007
2007-07-31    2007
2007-08-31    2007
2007-09-30    2007
2007-10-31    2007
2007-11-30    2007
2007-12-31    2007
2008-01-31    2008
2008-02-29    2008
2008-03-31    2008
2008-04-30    2008
2008-05-31    2008
2008-06-30    2008
2008-07-31    2008
2008-08-31    2008
Freq: ME, Name: Year, dtype: int32

In [75]:
print(patient_df.columns)

Index(['Colombo_cases', 'Gampaha_cases', 'Kalutara_cases', 'Kandy_cases',
       'Matale_cases', 'Nuwara_Eliya_cases', 'Galle_cases', 'Hambantota_cases',
       'Matara_cases', 'Jaffna_cases', 'Kilinochchi_cases', 'Mannar_cases',
       'Vavuniya_cases', 'Mullaitivu_cases', 'Batticaloa_cases',
       'Ampara_cases', 'Trincomalee_cases', 'Kurunegala_cases',
       'Puttalam_cases', 'Anuradhapura_cases', 'Polonnaruwa_cases',
       'Badulla_cases', 'Monaragala_cases', 'Ratnapura_cases', 'Kegalle_cases',
       'Kalmunai_cases', 'Year', 'Month'],
      dtype='object')

In [76]:
final_patient_df = patient_df.melt(id_vars=['Year', 'Month'], var_name='station_name', value_name='patients')

In [77]:
# patient_df.to_csv("Data/Preprocessed Data/column_patient_count.csv", index=None)
final_patient_df.to_csv("Data/Preprocessed Data/extracted_patient_data.csv", index=None)

In [78]:
final_patient_df = final_patient_df[
       final_patient_df["station_name"].isin([
              "Colombo_cases",
              "Gampaha_cases",
              "Kandy_cases",
              "Galle_cases",
              "Jaffna_cases",
              "Batticaloa_cases",
              "Kurunegala_cases",
              "Puttalam_cases",
              "Ratnapura_cases",
       ])
]

In [79]:
# replace the station names with the actual names
final_patient_df["station_name"] = final_patient_df["station_name"].str.replace("_cases", "")

In [80]:
final_patient_df.station_name.unique()  # check the unique values in the station_name column

array(['Colombo', 'Gampaha', 'Kandy', 'Galle', 'Jaffna', 'Batticaloa',
       'Kurunegala', 'Puttalam', 'Ratnapura'], dtype=object)

In [81]:
print(final_patient_df.head(10))

   Year Month station_name  patients
0  2007   Jan      Colombo     244.0
1  2007   Feb      Colombo     175.0
2  2007   Mar      Colombo      61.0
3  2007   Apr      Colombo      35.0
4  2007   May      Colombo      44.0
5  2007   Jun      Colombo     102.0
6  2007   Jul      Colombo     163.0
7  2007   Aug      Colombo     128.0
8  2007   Sep      Colombo     158.0
9  2007   Oct      Colombo     178.0

In [82]:
# store the final patient data in a csv file
final_patient_df.to_csv("Data/Preprocessed Data/final_patient_data.csv", index=None)

## Weather Data Preprocessing

#### Column naming related transformations for the dataframes

In [83]:
rainfall_df.rename(columns={'yyyy': 'Year','month':'Month','value':'precipitation'}, inplace=True)
humidity_df.rename(columns={'Station_Name': 'station_name','Data_Value':'humidity'}, inplace=True)
wind_speed_df.rename(columns={'Data1': 'wind_speed_8_30am','Data2':'wind_speed_17_30pm'}, inplace=True)

In [84]:
# drop the code and abbreviation columns from the rainfall data
rainfall_df.drop(['code', 'abbreviation'], axis=1, inplace=True)

In [85]:
rainfall_df.head(10)

  station_name  elevation  Year Month  precipitation
0        GALLE         12  2007   Jan      78.200000
1        GALLE         12  2008   Jan     189.200001
2        GALLE         12  2009   Jan       8.100000
3        GALLE         12  2010   Jan      72.000001
4        GALLE         12  2011   Jan     178.999998
5        GALLE         12  2012   Jan      15.800000
6        GALLE         12  2013   Jan      64.599998
7        GALLE         12  2014   Jan      61.000001
8        GALLE         12  2015   Jan      68.300000
9        GALLE         12  2016   Jan      40.700001

In [86]:
temperature_df.head(10)

  station_name  Year Month  TMPMAX  TMPMIN
0       JAFFNA  2016   Apr    35.7    27.7
1     PUTTALAM  2015   Apr    32.5    19.1
2  KATUGASTOTA  2015   Apr    31.0    20.2
3   KURUNEGALA  2023   Apr    34.4     NaN
4  KATUGASTOTA  2017   Apr    31.8     NaN
5   KURUNEGALA  2012   Apr    33.0    23.0
6   KURUNEGALA  2022   Apr    33.2    24.0
7   KATUNAYAKA  2011   Apr    31.5    24.0
8   BATTICALOA  2008   Apr    32.3    25.0
9   KATUNAYAKA  2010   Apr    32.2    25.0

In [87]:
# remove the DEDIGAMA or ST.VINCENTS GROUP station_name data from the rainfall dataframe
rainfall_df = rainfall_df[rainfall_df.station_name != 'DEDIGAMA' ]
rainfall_df = rainfall_df[rainfall_df.station_name != 'ST.VINCENTS GROUP' ]

In [88]:
# station_names in wind_speed_df convert to all capital
wind_speed_df['station_name'] = wind_speed_df['station_name'].str.upper()
print(wind_speed_df.station_name.unique())

['BATTICALOA' 'COLOMBO' 'GALLE' 'JAFFNA' 'KATUGASTOTA' 'KATUNAYAKE'
 'KURUNEGALA' 'PUTTALAM' 'RATNAPURA']

In [89]:
# make sure station_name for KATUNAYAKE is consistent in all dataframes instead of KATUNAYAKA
humidity_df['station_name'] = humidity_df['station_name'].replace('KATUNAYAKA', 'KATUNAYAKE')
rainfall_df['station_name'] = rainfall_df['station_name'].replace('KATUNAYAKA', 'KATUNAYAKE')
wind_speed_df['station_name'] = wind_speed_df['station_name'].replace('KATUNAYAKA', 'KATUNAYAKE')
temperature_df['station_name'] = temperature_df['station_name'].replace('KATUNAYAKA', 'KATUNAYAKE')

In [90]:
# check unique stations
humidity_stations = humidity_df.station_name.unique()
print(humidity_stations)

['GALLE' 'JAFFNA' 'COLOMBO' 'PUTTALAM' 'RATNAPURA' 'BATTICALOA'
 'KATUNAYAKE' 'KURUNEGALA' 'KATUGASTOTA']

In [91]:
# check unique stations
temperature_stations = temperature_df.station_name.unique()
print(temperature_stations)

['JAFFNA' 'PUTTALAM' 'KATUGASTOTA' 'KURUNEGALA' 'KATUNAYAKE' 'BATTICALOA'
 'COLOMBO' 'GALLE' 'RATNAPURA']

In [92]:
# check unique stations
rainfall_stations = rainfall_df.station_name.unique()
print(rainfall_stations)

['GALLE' 'JAFFNA' 'COLOMBO' 'PUTTALAM' 'RATNAPURA' 'BATTICALOA'
 'KATUNAYAKE' 'KURUNEGALA' 'KATUGASTOTA']

In [93]:
# check unique stations
wind_stations = wind_speed_df.station_name.unique()
print(wind_stations)

['BATTICALOA' 'COLOMBO' 'GALLE' 'JAFFNA' 'KATUGASTOTA' 'KATUNAYAKE'
 'KURUNEGALA' 'PUTTALAM' 'RATNAPURA']

In [94]:
t1 = np.intersect1d(humidity_stations, temperature_stations)
print(t1)

['BATTICALOA' 'COLOMBO' 'GALLE' 'JAFFNA' 'KATUGASTOTA' 'KATUNAYAKE'
 'KURUNEGALA' 'PUTTALAM' 'RATNAPURA']

In [95]:

t2 = np.intersect1d(rainfall_stations,wind_stations)
print(t2)

['BATTICALOA' 'COLOMBO' 'GALLE' 'JAFFNA' 'KATUGASTOTA' 'KATUNAYAKE'
 'KURUNEGALA' 'PUTTALAM' 'RATNAPURA']

In [96]:
print(np.intersect1d(t1,t2))

['BATTICALOA' 'COLOMBO' 'GALLE' 'JAFFNA' 'KATUGASTOTA' 'KATUNAYAKE'
 'KURUNEGALA' 'PUTTALAM' 'RATNAPURA']

#### Combining the dataframes into a single dataframe

In [97]:
wind_speed_df.head(5)

  station_name  Year Month  wind_speed_8_30am  wind_speed_17_30pm
0   BATTICALOA  2007   Jan                8.6                10.1
1   BATTICALOA  2007   Feb                3.7                 9.6
2   BATTICALOA  2007   Mar                1.0                 8.1
3   BATTICALOA  2007   Apr                1.9                 5.8
4   BATTICALOA  2007   May                0.7                 5.3

In [98]:
# joining the rainfall_df, humidity_df, temperature_df and wind_speed_df dataframes using the station_name, year and month columns into one dataframe
from pandasql import sqldf
join = "INNER"

In [99]:
weather_df = sqldf(f"SELECT h.Year, h.Month, h.station_name, r.elevation, h.humidity, t.TMPMAX, t.TMPMIN, r.precipitation, w.wind_speed_8_30am, w.wind_speed_17_30pm\
            FROM humidity_df AS h \
             {join} JOIN temperature_df AS t \
             ON t.Year = h.Year AND t.Month = h.Month AND t.station_name = h.station_name\
             {join} JOIN  rainfall_df AS r\
             ON r.Year = h.Year AND r.Month = h.Month AND r.station_name = h.station_name\
             {join} JOIN wind_speed_df AS w\
             ON w.Year = h.Year AND w.Month = h.Month AND w.station_name = h.station_name")

In [100]:
# Replace the station names with the actual names in the weather data like For KATUNAYAKE replace with Gampaha like that
replace_values = {
    "KATUNAYAKE": "Gampaha",
    "COLOMBO": "Colombo",
    "GALLE": "Galle",
    "BATTICALOA": "Batticaloa",
    "JAFFNA": "Jaffna",
    "KATUGASTOTA": "Kandy",
    "KURUNEGALA": "Kurunegala",
    "PUTTALAM": "Puttalam",
    "RATNAPURA": "Ratnapura",
}
weather_df["station_name"] = weather_df["station_name"].replace(replace_values)

In [101]:
weather_df.station_name.unique()

array(['Galle', 'Jaffna', 'Colombo', 'Puttalam', 'Ratnapura',
       'Batticaloa', 'Gampaha', 'Kurunegala', 'Kandy'], dtype=object)

In [102]:
weather_df.sort_values(by=['Year', 'Month','station_name'], inplace=True)

In [103]:
weather_df.to_csv("Data/Preprocessed Data/weather_data_final.csv", index=None)

In [104]:
# # Remove null values from the specified column in weather_df
# weather_df_cleaned = weather_df.dropna(subset=['precipitation'])

# # Remove null values from the specified column in humidity_df
# rainfall_df_cleaned = rainfall_df.dropna(subset=['precipitation'])

# # check value are equals
# if weather_df_cleaned[['station_name','Year','Month','precipitation']].equals(rainfall_df_cleaned[['station_name','Year','Month','precipitation']]):
#     print('Dataframes are equal')
# else:
#     raise ValueError('Dataframes are not equal')

### Merge weather data and patient data

In [105]:
# merge patient data with weather data
final_df = sqldf("SELECT w.*, p.patients\
               FROM weather_df AS w\
               INNER JOIN final_patient_df AS p\
               ON w.Year = p.Year AND w.Month = p.Month AND w.station_name = p.station_name"
)

In [106]:
final_df[final_df.duplicated(['Year', 'Month', 'station_name'])]

Empty DataFrame
Columns: [Year, Month, station_name, elevation, humidity, TMPMAX, TMPMIN, precipitation, wind_speed_8_30am, wind_speed_17_30pm, patients]
Index: []

In [107]:
# convert Year and Month columns into single timestamp column 
# turn months into numbers
final_df['Month'] = final_df['Month'].apply(lambda x: list(calendar.month_abbr).index(x))
final_df['Date'] = pd.to_datetime(final_df[['Year', 'Month']].assign(day=1))

In [108]:
final_df.to_csv("Data/Preprocessed Data/final_data.csv", index=None)

## Feature engineering

In [109]:
# convert date into date64 datatype
final_df['Date'] = pd.to_datetime(final_df['Date']).dt.normalize()
final_df['patients'] = final_df.patients.astype('int64')

In [110]:
final_df.dtypes

Year                           int64
Month                          int64
station_name                  object
elevation                      int64
humidity                     float64
TMPMAX                       float64
TMPMIN                       float64
precipitation                float64
wind_speed_8_30am            float64
wind_speed_17_30pm           float64
patients                       int64
Date                  datetime64[ns]
dtype: object

In [111]:
final_df.isna().sum() # check null value count for the each feature

Year                    0
Month                   0
station_name            0
elevation               0
humidity               60
TMPMAX                 24
TMPMIN                 37
precipitation           7
wind_speed_8_30am     204
wind_speed_17_30pm    208
patients                0
Date                    0
dtype: int64

In [112]:
final_df.columns

Index(['Year', 'Month', 'station_name', 'elevation', 'humidity', 'TMPMAX',
       'TMPMIN', 'precipitation', 'wind_speed_8_30am', 'wind_speed_17_30pm',
       'patients', 'Date'],
      dtype='object')

## Imputations

#### KNN imputator

In [113]:
from sklearn.impute import KNNImputer
import pandas as pd

# Initialize the KNNImputer
knn_imp = KNNImputer(n_neighbors=5)

knn_df = final_df.copy()

# Select the columns you want to impute
columns_to_impute = ['humidity', 'TMPMAX', 'TMPMIN', 'precipitation', 'wind_speed_8_30am', 'wind_speed_17_30pm']

In [114]:

# Perform the imputation on the selected columns
imputed_data = knn_imp.fit_transform(knn_df[columns_to_impute])

# Convert the imputed data back into a DataFrame
imputed_df = pd.DataFrame(imputed_data, columns=columns_to_impute)

# Replace the original columns in the DataFrame with the imputed ones
knn_df[columns_to_impute] = imputed_df

In [115]:
knn_df.isna().sum()

Year                  0
Month                 0
station_name          0
elevation             0
humidity              0
TMPMAX                0
TMPMIN                0
precipitation         0
wind_speed_8_30am     0
wind_speed_17_30pm    0
patients              0
Date                  0
dtype: int64

In [116]:
knn_df.dropna()
knn_df.drop(columns=['elevation'],inplace=True)

#### Create timeseries sequence by sorting according to the date and remove the date afterwards

In [117]:
knn_df.sort_values('Date',inplace=True)
# knn_df.drop('Date',axis=1,inplace=True)

In [118]:
knn_df.head()

,Year,Month,station_name,humidity,TMPMAX,TMPMIN,precipitation,wind_speed_8_30am,wind_speed_17_30pm,patients,Date
39,2007,1,Gampaha,85.838710,32.0,22.1,39.399999,12.5,14.50,64,2007-01-01
36,2007,1,Batticaloa,82.064516,28.4,24.0,170.100004,8.6,10.10,0,2007-01-01
37,2007,1,Colombo,82.258065,31.8,22.9,91.100001,5.7,6.00,244,2007-01-01
38,2007,1,Galle,89.612903,29.6,23.3,78.200000,2.2,6.90,22,2007-01-01
40,2007,1,Jaffna,81.886667,29.7,22.2,12.500000,5.3,7.12,0,2007-01-01

### Save the final knn imputed data in a csv

In [119]:
knn_df.to_csv("Data/Preprocessed Data/preprocessed_data.csv", index=None)